
%整序和折叠

fid=fopen('seq&fold.txt','w');  %高压开关，128线，128开关位置

TX=[1,17,33,49,65,81,97,113,
    2,18,34,50,66,82,98,114,
    3,19,35,51,67,83,99,115,
    4,20,36,52,68,84,100,116,
    5,21,37,53,69,85,101,117,
    6,22,38,54,70,86,102,118,
    7,23,39,55,71,87,103,119,
    8,24,40,56,72,88,104,120,
    9,25,41,57,73,89,105,121,
    10,26,42,58,74,90,106,122,
    11,27,43,59,75,91,107,123,
    12,28,44,60,76,92,108,124,
    13,29,45,61,77,93,109,125,
    14,30,46,62,78,94,110,126,
    15,31,47,63,79,95,111,127,
    16,32,48,64,80,96,112,128];

%顺序：中心16通道 128行;外边16通道 128行，
%奇偶折叠是一样的
%中心16通道 128行，

for i=1:1:128                     % 64 开关位置
    SW_PHY_EVEN=[i:1:i+15]-8;     % 采用的通道
    SEQ=zeros(16,8);
    for j=1:1:16                % 遍历16个通道
       for m=1:1:16             % 遍历所有的开关位置
         for n=1:1:8
            if(SW_PHY_EVEN(j)== TX(m,n)) % m for AX，j for AY  of MT8816
                if(j<=8)
                    SEQ(m,j)=1;          
                else
                    SEQ(m,17-j)=1;
                end
            end   
        end
       end
    end
    for m=1:1:16
         for n=1:1:8
             fprintf(fid,'%d',SEQ(m,n));
         end
         %fprintf(fid,'_');
    end
    
    
     fprintf(fid,'\r\n');
end





%偶数外周16通道 128行，
for i=1:1:128                     % 128 开关位置
    SW_PHY_EVEN=[i-8:1:i-1,i+16:1:i+23]-8;     % 采用的通道
    SEQ=zeros(16,8);
    for j=1:1:16                % 遍历16个通道
       for m=1:1:16             % 遍历所有的开关位置
         for n=1:1:8
            if(SW_PHY_EVEN(j)== TX(m,n)) % m for AX，j for AY  of MT8816
                if(j<=8)
                    SEQ(m,j)=1;          
                else
                    SEQ(m,17-j)=1;
                end
            end   
        end
       end
    end
    for m=1:1:16
         for n=1:1:8
             fprintf(fid,'%d',SEQ(m,n));
         end
         %fprintf(fid,'_');
    end
    
    
     fprintf(fid,'\r\n');
end
